# Introduction to Pandas

In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
#built on top of a numpy object
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}
#we have 4 different python objects, (labels, list, np array, dictionary)

In [3]:
pd.Series(data = my_data) #pass in a list

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = my_data, index = labels)  #pass in a list and define the index

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(data = arr) #pass in a np array

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(data = arr, index = labels) #pass in a np array and define index

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d) #pass in a dict. Takes the keys and uses them for the index

a    10
b    20
c    30
dtype: int64

In [8]:
#a series can hold a variety of object types (strings/object, categories, ints, floats)

In [9]:
#look up of series using the index
ser1 = pd.Series(data = [1,2,3,4], index = ['USA', 'Germany', 'USSR', 'Japan'])
ser2 = pd.Series(data = [1,3,5,4], index = ['USA', 'Germany', 'Italy', 'Japan'])
ser3 = pd.Series(data = labels)
ser1['USA'] #returns 1
ser1['USSR']  #returns 3
ser3[0] #returns 'a'
ser3[2] #returns 'c'
ser1 + ser2   #if there's no matching data in either series it will return null in that row.

Germany    5.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames - Part 1

In [10]:
from numpy.random import randn
np.random.seed(101)

In [11]:
df = pd.DataFrame(data = randn(5,4), index = ['A','B','C','D','E'], columns = ['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
#indexing a selection to grab a row/cell
df['W'] #returns 'W' column as a series
df[['W','Z']] #retruns 'W' and 'Z' columns as a new df

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [13]:
#creating a new column
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [14]:
#remove a column
df.drop('new', axis = 1, inplace = True)  #need to set the axis to 1 to refer to the columns
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
#can also drop rows
df.drop('E', axis = 0) #will need to set inplace = True to save it to the actual df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [16]:
#selecting rows (2 ways)
df.loc['C'] #takes in a label and the stop param is inclusive #returns a new series with the columns now as index
df.iloc[2]  #takes in an index position and stop param is exclusive #returns new series with columns now as index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [17]:
#selecting subsets of rows and columns
df.loc['B','Y'] #returns single value in the corresponding cell
df.loc[['A','B'],['W','Y']] #returns new df with a,b rows and w,y columns

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# DataFrames - Part 2

In [18]:
np.random.seed(101)
df = pd.DataFrame(data = randn(5,4), index = ['A','B','C','D','E'], columns = ['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Conditional selection

In [19]:
df > 0  #returns a df of boolean values

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [20]:
df[df>0]  #passing the boolean df into the df returns all the values greater than 0 and nan for vals < 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df['W']>0  #C is the only column that is false

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [22]:
df[df['W']> 0]  #using a boolean series will return only the columns of the df in which that series is true

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df[df['Z']<0]  #returns the rows where z is less than 0

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [24]:
#can pull results off the resulting df
df[df['W']>0][['Y','X']]  #returns column Y and X based on the resulting df from boolean series 'W' > 0

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [25]:
#multiple conditions
df[(df['W']> 0) & (df['Y'] > 1)] #and
df[(df['W']> 0) | (df['Y'] > 1)] #or

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### setting/resetting index

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df.reset_index()  #inplace = True  #resets index back to numerican index 0 - n

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [28]:
new_ind = 'CA NY WY OR CO'.split(' ')
df['States'] = new_ind
df.set_index(keys = 'States') #inplace = True  #overwrites the originally defined index

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# DataFrames - Part 3

In [29]:
#index levels
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))  #creates a list of tuple pairs
hier_index = pd.MultiIndex.from_tuples(hier_index)  #creats a multiIndex based of those tuple pairs
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [33]:
df = pd.DataFrame(randn(6,2), index = hier_index, columns = ['A','B'])
df #multiIndex df is created

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

#### Selecting data from MultiIndex df

In [35]:
df.loc['G1'] #returns new df

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [37]:
df.loc['G1'].iloc[2] #returns new series with the values from G1-3

A   -0.116773
B    1.901755
Name: 3, dtype: float64

In [44]:
df.iloc[1]  #returns a new series of the second row (ignoring the outer index all together)

A   -0.943406
B    0.484752
Name: (G1, 2), dtype: float64

In [46]:
#assigning names to an already existing index
df.index.names = ['Groups','Num']
print(df.index.names)
df

['Groups', 'Num']

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [48]:
df.loc['G2'].loc[2]['B']

0.19679950499134005

In [49]:
df.loc['G1'].loc[1]['A']

-0.49710402288933153

In [50]:
df.loc['G1'].iloc[0]['A']

-0.49710402288933153

#### Cross section of a df

In [53]:
df.xs(key = 'G1')  #returns new df with values from G1
#same as df.loc['G1']

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [58]:
#has the ability to go inside a multilevel index
df.xs(key = 2, level = 'Num')
#returns label 2 from G1 and G2 as a new df G1/2/A, G1/2/B, G2/2/A, G2/2/B

               A         B
Groups
G1     -0.943406  0.484752
G2     -0.993263  0.196800

# Missing Data

In [59]:
#pandas automactically fills in missing data with NaN (null) value

In [60]:
import numpy as np
import pandas as pd
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### Dropping nan values

In [61]:
df.dropna()  #only returns rows with no missing values

     A    B  C
0  1.0  5.0  1

In [63]:
df.dropna(axis = 1)  #returns the columns with no NaN values

   C
0  1
1  2
2  3

In [62]:
df.dropna(how = 'all') #drops the rows that have NaN in every column

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [65]:
df.dropna(thresh = 2) #drops any rows with 2 or more NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [66]:
df.dropna(axis = 1, thresh = 2)  #drops any column with 2 or mroe NaN values

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

#### Filling NaN values

In [67]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [68]:
df.fillna(value = 'Fill Value')  #the string 'Fill Value' is added to any cell with NaN

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [69]:
#fill in the Nan values with the mean value of the column
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [71]:
df.fillna(method = 'pad')  #theres a method param 'pad'/'ffill' or 'backfill'/'bfill' to fill in na values
#'pad' takes the previous valid value to fill in the nan value
#'backfill' uses the next valid value to fill in the nan value

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

# GroupBy

#### group rows together and call aggregate functions on each group

In [73]:
import numpy as np
import pandas as pd
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)

In [74]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [75]:
#group by company
df.groupby(by = 'Company')

In [76]:
by_comp = df.groupby(by = 'Company')
by_comp.mean()  #returns new df in alphabetical order with the sales column mean'd

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [77]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [78]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [79]:
#can get the sales of a specific company by chaining methods
by_comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [80]:
df.groupby('Company').sum().loc['FB']  #same as above just in a single line

Sales    593
Name: FB, dtype: int64

In [81]:
df.groupby('Company').count()  #count of each company in a new df

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [82]:
df.groupby('Company').max()  #each column is max'd
#largest person is printed and the largest number of sales

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [84]:
df.groupby('Company').min()
#smallest person alphabetically and smallest sales
#The person with the smallest sales is not listed in this df

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [85]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging, Joining, and Concatenating

#### concat() method

In [94]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [95]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [96]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [97]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [100]:
pd.concat([df1,df2,df3], axis = 0)  #list of dfs you want to concat

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Merge() method  (uses a column to merge data)

In [101]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [102]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [103]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [105]:
pd.merge(left, right, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [106]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [107]:
left,right

(  key1 key2   A   B
 0   K0   K0  A0  B0
 1   K0   K1  A1  B1
 2   K1   K0  A2  B2
 3   K2   K1  A3  B3,
   key1 key2   C   D
 0   K0   K0  C0  D0
 1   K1   K0  C1  D1
 2   K1   K0  C2  D2
 3   K2   K0  C3  D3)

In [108]:
pd.merge(left, right, on = ['key1','key2'])  #inner join on the intersection of key1 and key2 from each df

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [109]:
pd.merge(left,right, how = 'outer', on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [110]:
pd.merge(left,right, how = 'right', on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

#### Joining   (uses the index to join)

In [111]:
#combining the columns of 2 potentially differently-indexed dfs into a single result
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [112]:
left,right

(     A   B
 K0  A0  B0
 K1  A1  B1
 K2  A2  B2,
      C   D
 K0  C0  D0
 K2  C2  D2
 K3  C3  D3)

In [113]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [114]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

In [115]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Finding unique values in a df

In [116]:
df['col2'].nunique()

3

In [117]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [118]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

#### selecting data

In [120]:
df[df['col1']>2]   #returns new df based on the returned boolean series df['col1']>2

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [122]:
#multiple conditiosn use & for and and | for or
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

#### apply method

In [124]:
#applies a function to every rows of a df/series
def times2(x):
    return x*2

In [126]:
df['col1'].apply(times2)  #returns a new series which can then be saved back into the df

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [127]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [128]:
#very useful when using lambda expressions
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

#### removing columns

In [129]:
df.drop('col1', axis = 1)  #inplace = True

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### get column names

In [131]:
df.columns  #retunrs an index object

Index(['col1', 'col2', 'col3'], dtype='object')

In [132]:
df.columns[1]

'col2'

#### get index names

In [133]:
df.index

RangeIndex(start=0, stop=4, step=1)

#### sorting/ordering a df

In [134]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [136]:
df.sort_values(by = 'col2')  #inplace = True

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

#### Finding null values in your df

In [137]:
df.isnull()  #returns df with booleans depending if the cell is nan

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

#### pivot table method

In [139]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [140]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [141]:
df.pivot_table(values = 'D', index = ['A','B'])

           D
A   B
bar one  2.5
    two  5.0
foo one  2.0
    two  2.0

In [142]:
df.pivot_table(values = 'D', index = ['A','B'], columns=['C'])
#null values for bar/two/x and foo/two/y since they don't exist in the original df

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [144]:
# 4 main data sources we'll cover here (csv,excel, html, sql)
#need to install sqlalchemy, lxml, html5lib, BeautifulSoup4 to work with all these data sources

In [168]:
import pandas as pd
import bs4 as bs

#### reading csv

In [149]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [152]:
df = pd.read_csv('example')

In [153]:
df.to_csv('my_output', index = False)  #now my output is saved as a csv in the same directory

In [154]:
pd.read_csv('my_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### reading from excel files

In [ ]:
#can only import data, not formulas, macros, etc

In [163]:
pd.read_excel('Excel_Sample.xlsx',sheet_name = 'Sheet1', index_col = [0])

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [165]:
df.to_excel('excel_sample2.xlsx', sheet_name = 'Sheet_test')

In [167]:
pd.read_excel('excel_sample2.xlsx',sheet_name = 'Sheet_test',index_col = [0])

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### html files

In [173]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
#this is actually stored in a list

In [178]:
data  #the data from this site is stored as a list

[                             Bank Name           City  ST   CERT  \
 0                 The First State Bank  Barboursville  WV  14361
 1                   Ericson State Bank        Ericson  NE  18265
 2     City National Bank of New Jersey         Newark  NJ  21111
 3                        Resolute Bank         Maumee  OH  58317
 4                Louisa Community Bank         Louisa  KY  58112
 ..                                 ...            ...  ..    ...
 556                 Superior Bank, FSB       Hinsdale  IL  32646
 557                Malta National Bank          Malta  OH   6629
 558    First Alliance Bank & Trust Co.     Manchester  NH  34264
 559  National State Bank of Metropolis     Metropolis  IL   3815
 560                   Bank of Honolulu       Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                         MVB Bank, Inc.      April 3, 2020
 1             Farmers and Merchants Bank  February 14, 2020
 2                        Industrial Bank   November 1, 2019
 3                     Buckeye State Bank   October 25, 2019
 4      Kentucky Farmers Bank Corporation   October 25, 2019
 ..                                   ...                ...
 556                Superior Federal, FSB      July 27, 2001
 557                    North Valley Bank        May 3, 2001
 558  Southern New Hampshire Bank & Trust   February 2, 2001
 559              Banterra Bank of Marion  December 14, 2000
 560                   Bank of the Orient   October 13, 2000

 [561 rows x 6 columns]]

In [177]:
type(data)

list

In [176]:
data[0]  #the first item of the data list is actually the df we want

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [179]:
type(data[0])

pandas.core.frame.DataFrame

#### sql

In [ ]:
#pandas is not the best way to read sql, Should look at the specific sql engine to get more details